import {setId, EquipType, getData} from "@/utils/other.js";

let typeList = [
    ["剑", ["攻击强度", "力量", "耐力"]],
    ["盾牌", ["护甲  ", "力量", "耐力"]],
    ["弓", ["射击强度", "敏捷", "耐力"]],
    ["箭袋", ["射击强度", "敏捷", "耐力"]],
    ["法杖", ["魔法强度", "智慧", "耐力"]],
    ["法典", ["魔法强度", "智慧", "耐力"]],
    ["骑士套装", ["护甲  ", "力量", "耐力"]],
    ["射手套装", ["护甲  ", "敏捷", "耐力"]],
    ["法师套装", ["护甲  ", "智慧", "耐力"]],
    ["骑士饰品", ["力量  ", "耐力"]],
    ["射手饰品", ["敏捷  ", "耐力"]],
    ["法师饰品", ["智慧  ", "耐力"]]
].map(item => new EquipType(...item))

typeList = setId(typeList)

export default typeList